#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_role_policy_document: Read complete after 0s [id=1789900679][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=199660179115][0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.github_deployment_oidc_assume_role_policy: Read complete after 0s [id=1243534753][0m
[0m[1maws_iam_role.github_deployment_oidc_role: Refreshing state... [id=github-deployment-oidc-role][0m
[0m[1maws_iam_role_policy.github_actions_role_policy: Refreshing state... [id=github-deployment-oidc-role:github_deployment_oidc_role_policy][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_wafv2_web_acl.web_acl_cloudfront[0m will be created
[0m  [32m+[0m[0m resource "aws_wafv2_web_acl" "web_acl_cloudfront" {
      [32m+[0m[0m arn         = (known after apply)
      [32m+[0m[0m capacity    = (known after apply)
      [32m+[0m[0m description = "waf managed rule."
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m lock_token  = (known after apply)
      [32m+[0m[0m name        = "dev-cloudfront"
      [32m+[0m[0m scope       = "CLOUDFRONT"
      [32m+[0m[0m tags_all    = (known after apply)

      [32m+[0m[0m default_action {
          [32m+[0m[0m allow {
            }
        }

      [32m+[0m[0m rule {
          [32m+[0m[0m name     = "AWS-AWSManagedRulesCommonRuleSet"
          [32m+[0m[0m priority = 1

          [32m+[0m[0m override_action {
              [32m+[0m[0m none {}
            }

          [32m+[0m[0m statement {
              [32m+[0m[0m managed_rule_group_statement {
                  [32m+[0m[0m name        = "AWSManagedRulesCommonRuleSet"
                  [32m+[0m[0m vendor_name = "AWS"

                  [32m+[0m[0m rule_action_override {
                      [32m+[0m[0m name = "NoUserAgent_HEADER"

                      [32m+[0m[0m action_to_use {
                          [32m+[0m[0m count {
                            }
                        }
                    }
                }
            }

          [32m+[0m[0m visibility_config {
              [32m+[0m[0m cloudwatch_metrics_enabled = false
              [32m+[0m[0m metric_name                = "AWSManagedRulesATPRuleSet"
              [32m+[0m[0m sampled_requests_enabled   = false
            }
        }

      [32m+[0m[0m visibility_config {
          [32m+[0m[0m cloudwatch_metrics_enabled = false
          [32m+[0m[0m metric_name                = "friendly-metric-name"
          [32m+[0m[0m sampled_requests_enabled   = false
        }
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dtaylor77, Action: `pull_request`, Workflow: `Aquaservices Infra DEV`*